<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ActivitesSeeder extends Seeder
{
    public function run(): void
    {
        DB::table('activites')->insert([
            ['id' => 4, 'created_at' => '2021-04-07 08:33:42', 'updated_at' => '2026-06-21 11:35:11', 'titre' => 'الورشة الشهرية "التغذية و التوحد"', 'description' => 'ورشات في موضوع التغذية و التوحد من تأطير الدكتورة عفاف حفيظ', 'date_activite' => '2021-04-30', 'image_activite' => '1618004113.jpg', 'type_activite_id' => 4, 'ajoutAuxInfos' => 1],
            ['id' => 5, 'created_at' => '2021-04-09 20:41:35', 'updated_at' => '2021-04-27 01:40:32', 'titre' => 'حصص تقويم النطق', 'description' => 'حصص تقويم النطق من تأطير الاخصائية مريم المجدوب', 'date_activite' => '2021-04-28', 'image_activite' => '1618350170.jpg', 'type_activite_id' => 5, 'ajoutAuxInfos' => 2],
            ['id' => 6, 'created_at' => '2021-04-28 01:05:14', 'updated_at' => '2021-04-28 01:05:14', 'titre' => '"بلسم" تخلد اليوم العالمي لإذكاء الوعي بالتوحد', 'description' => 'إضاءة واجهة مقر بلدية القنيطرة باللون الأزرق تخليدا لليوم العالمي للتوحد', 'date_activite' => '2021-04-02', 'image_activite' => '1619571914.jpg', 'type_activite_id' => 6, 'ajoutAuxInfos' => 1],
            ['id' => 8, 'created_at' => '2022-03-17 20:16:05', 'updated_at' => '2022-03-17 20:39:05', 'titre' => 'دورة تكوينية في "منهجية مونيتسوري" لفائدة الأسر و المربين', 'description' => 'دورة تكوينية في منهجية مونيتسوري من تأطير المدربة سميرة الرجواني', 'date_activite' => '2022-03-19', 'image_activite' => '1647553145.jpg', 'type_activite_id' => 8, 'ajoutAuxInfos' => 1],
            ['id' => 9, 'created_at' => '2022-03-20 20:56:08', 'updated_at' => '2022-03-20 20:56:08', 'titre' => 'تدريب في : منهجية مونتسوري', 'description' => 'دورة تكوينية في منهجية مونتيسوري أطرتها المدربة سميرة الرجواني', 'date_activite' => '2022-03-20', 'image_activite' => '1647813366.jpg', 'type_activite_id' => 8, 'ajoutAuxInfos' => 1],
            ['id' => 10, 'created_at' => '2022-03-27 21:21:40', 'updated_at' => '2022-03-27 21:21:40', 'titre' => 'ندوة علمية', 'description' => 'ندوة علمية حول الأسرة والمدرسة والمجتمع المدني وأسئلة الإنصاف', 'date_activite' => '2022-03-30', 'image_activite' => '1648416100.jpg', 'type_activite_id' => 6, 'ajoutAuxInfos' => 1],
            ['id' => 11, 'created_at' => '2022-03-31 23:38:40', 'updated_at' => '2022-03-31 23:38:40', 'titre' => 'مشاركة أطفال "بلسم" في حفل الكرمس', 'description' => 'شارك أطفال جمعية بلسم في "حفل الكرمس" المنظم بالمركز الوطني محمد السادس بسلا، على إثر اختتام أشغال الملتقى الوطني ال 13
و بهذه المناسبة تتوجه جمعية بلسم لذوي التوحد للسيد هشام عثماني رئيس القطب التربوي الإجتماعي بالمركز بجزيل الشكر على الدعوة الكريمة و حفاوة الاستقبال و التنظيم المحكم، و إلى كافة مسؤولي و أطر المركز.', 'date_activite' => '2022-03-31', 'image_activite' => '1648769920.jpg', 'type_activite_id' => 7, 'ajoutAuxInfos' => 1],
            ['id' => 12, 'created_at' => '2022-03-31 23:48:33', 'updated_at' => '2022-03-31 23:50:04', 'titre' => 'بلسم في ندوة علمية و اسئلة الإنصاف و التكفل باطفال التوحد', 'description' => 'تخليدا لليوم العالمي للتوحد، نظمت جمعية بلسم لذوي التوحد ندوة علمية يوم الأربعاء 30 مارس 2022 في موضوع الأسرة والمدرسة والمجتمع المدني وأسئلة تكافؤ الفرص والانصاف والتكفل بالأطفال ذوي اضطراب التوحد،  
و انقسمت الندوة إلى ثلاث مداخلات أساسية ==
	المداخلة الأولى: "خصوصية التكفل النفسي للأطفال ذوي التوحد" من تأطير الدكتور نبيل شكوح، أستاذ بشعبة علم النفس بجامعة ابن طفيل بالقنيطرة.==
	المداخلة الثانية: "مسؤولية الأسرة في الدمج الاجتماعي للأطفال ذوي التوحد" من تاطير الأخصائي محمد ناصري، أخصائي نفسي عصبي بمستشفى الرازي بسلا و باحث في سلك الدكتور.==
	المداخلة الثالثة: "دور المجتمع المدني في الترافع عن الأشخاص ذوي اضطراب التوحد" من تأطير السيدة عفاف عفان، رئيسة تحالف الجمعيات العاملة في مجال إعاقة التوحد بالمغرب.', 'date_activite' => '2022-03-30', 'image_activite' => '1648770513.jpg', 'type_activite_id' => 10, 'ajoutAuxInfos' => 1],
            ['id' => 13, 'created_at' => '2022-04-11 21:21:46', 'updated_at' => '2022-04-11 21:21:46', 'titre' => 'بلسم تخلد اليوم العالمي للتوحد 2022', 'description' => 'احتفاء باليوم العالمي للتحسيس باضطراب طيف التوحد، خلدت جمعية بلسم لذوي التوحد بالقنيطرة هذا اليوم، بتنسيق مع إدارة المكتب الوطني للسكك الحديدية، حيث اكتست واجهة محطة القطار بالقنيطرة حلة زرقاء طيلة ليلة يوم الجمعة 08/04/2022. 

هذا وقد حج إلى ساحة محطة القطار  أطفال  وأسر ذوي التوحد إلى جانب بعض الزوار ...  

كما تم توزيع مطويات توعوية تحسيسية  على المسافرين و مرتادي محطة القطار بالقنيطرة، بهدف تسليط الضوء على اضطراب طيف التوحد لاذكاء الوعي لدى أفراد المجتمع بشأن هذا الاضطراب وأسبابه وطرق علاجه وتصحيح المفاهيم الخاطئة والشائعة عنه، وكذا الطرق المثلى للتعامل معه.. كما عرف الحدث تغطية لمجموعة من وسائل الإعلام الوطنية. 

يشار انه تم تخليد هذا الحدث السنة الماضية بالساحة الإدارية لجماعة القنيطرة.', 'date_activite' => '2022-04-08', 'image_activite' => '1649712104.jpg', 'type_activite_id' => 6, 'ajoutAuxInfos' => 1],
            ['id' => 15, 'created_at' => '2022-06-29 18:48:48', 'updated_at' => '2022-06-29 18:48:48', 'titre' => 'خرجة التفريغ النفسي للأزواج', 'description' => 'إيمانا منا في جمعية بلسم بالدور المحوري للأسرة كرافعة أساسية في الخطة العلاجية للطفل التوحدي، و ضرورة توفير الاطمئنان النفسي لها، ---
و نظرا للضغط الهائل الذي تتعرض له الأسرة بشكل عام و للزوجين بشكل خاص، و إيمانا بدور التربية الإيجابية في تحقيق الاندماج للطفل التوحدي، ---
نظمت جمعية بلسم لذوي التوحد يوم الاحد 26 يونيو 2022، لقاء بنكهة البلسم لإعادة إحياء جميل العشرة الطيبة وصيانة الود والوفاء و المحبة. ---
حيث عرفت الخرجة المقامة على شاطئ مهدية، المؤطرة من طرف الأخصائية النفسية إلهام القرش، مواد و أنشطة ترفيهية مختلفة، ركزت على تقوية مجموعة  من الأهداف : التواصل الفعال بين الأزواج، التفريغ النفسي، الإنصات، بناء الفريق، تقوية الروابط العاطفية بين الزوجين ... ---
و قد عرف النشاط مشاركة مجموعة من الأزواج الذين يتلقى أطفالهم المواكبة و المتابعة و التأهيل داخل جمعية "بلسم".', 'date_activite' => '2022-06-26', 'image_activite' => '1656532127.jpg', 'type_activite_id' => 7, 'ajoutAuxInfos' => 1],
            ['id' => 16, 'created_at' => '2022-07-08 20:39:56', 'updated_at' => '2022-07-08 20:39:56', 'titre' => 'احتفال بلسم بنجاح كاتبها العام', 'description' => 'احتفت أسرة جمعية بلسم لذوي التوحد بنجاح كاتبها العام الأستاذ عبد القادر الفريحي، بمناسبة نيله شهادة الإجازة في علم الاجتماع في موضوع: "تقييم المدرسين لتجربة أقسام الدمج الخاصة بتدريس الأطفال ذوي اضطراب التوحد" ---
حيث نظم حفل رمزي على شرف هذا التتويج العلمي، تكريسا للروح الأخوية السائدة داخل جمعية بلسم، و ترسيخا لرهان جمعية بلسم على البحث العلمي كرافعة أساسية لمقاربة موضوع التوحد. ---
و تجدر الإشارة الى أن هذه هي الإجازة الثانية التي يحصل عليها السيد عبد القادر الفريحي بعد 20 سنة من حصوله على الأولى، كما أنه هو أستاذ سابق متقاعد. ---
فهنيئا له و لأسرة جمعية بلسم بهذا التتويج العلمي.', 'date_activite' => '2022-07-06', 'image_activite' => '1657316396.jpg', 'type_activite_id' => 11, 'ajoutAuxInfos' => 1],
            ['id' => 17, 'created_at' => '2022-11-22 20:46:25', 'updated_at' => '2022-11-22 20:46:25', 'titre' => 'بلسم في نشاط ترفيهي', 'description' => 'نظمت جمعية بلسم لذوي التوحد بالقنيطرة بشراكة مع نادي ROTARACT ENCG KENITRA نشاطا ترفيهيا فنيا لفائدة أطفال الجمعية صبيحة يوم الأحد 20 نونبر 2022 بفضاء الجمعية، بمناسبة ذكرى المسيرة الخضراء وعيد الاستقلال.---
حيث افتتح النشاط بترديد النشيد الوطني، تلته كلمة للسيد رئيس الجمعية و كلمة عن نادي .ROTARACT  ---
هذا و اشتمل النشاط على فقرات متنوعة ضمت: ورشة للرسم، ورشة للتلوين والصباغة، ورشة رسم حيوانات على الوجه، فقرة البهلوان والأنشطة الحركية الراقصة، ألعاب ... و تخللت هذه الفقرات استراحة شاي استمتع بها الأطفال المشاركون و أسرهم.', 'date_activite' => '2022-11-20', 'image_activite' => '1669153584.jpg', 'type_activite_id' => 7, 'ajoutAuxInfos' => 1],
            ['id' => 18, 'created_at' => '2023-04-09 17:53:58', 'updated_at' => '2026-06-28 12:33:55', 'titre' => 'بلسم تخلد اليوم العالمي للتوحد 2023', 'description' => 'بمناسبة اليوم العالمي لاذكاء الوعي بالتوحد الذي صادف يوم الأحد 02 أبريل 2023 من هذه السنة، نظمت جمعية بلسم لذوي التوحد، بشراكة مع  أونورا  التابع ل ENCG القنيطرة، نشاطا ترفيهيا لأطفال "بلسم" مع حفل إفطار، بفضاء تقوية قدرات النساء باولاد اوجيه. 

حيث عرفت هذه المناسبة إقبالا من طرف جل المشاركين، الذين انخرطو في ورشات 
الرسم، التلوين، الاوريكامي، البازل .. كما عرف الحفل تنشيطا موسيقيا من طرف بهلوان، بالإضافة إلى ألعاب الحركة و القفز  "طرومبولين". ---

هذا و قد ختم النشاط بحفل إفطار على شرف المشاركين في جو أسري بهيج، شاركت فيه الأسر، تخللته كلمات للمنظمين و لبعض المشاركات', 'date_activite' => '2023-04-02', 'image_activite' => '1681062837.jpg', 'type_activite_id' => 6, 'ajoutAuxInfos' => 1],
        ]);
    }
}
