<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class InfosSeeder extends Seeder
{
    public function run(): void
    {
        DB::table('infos')->insert([
            ['id' => 4, 'created_at' => '2021-04-05 22:34:52', 'updated_at' => '2021-05-22 09:42:17', 'titre' => 'انطلاق أنشطة بلسم في مقرها الجديد', 'description' => 'انطلقت أنشطة جمعية بلسم لذوي التوحد في مقرها الجديد بدار الصحة بأولاد اوجيه، فيلا 58، قرب مدرسة اولاد اوجيه 3، في احترام تام للشروط الصحية الاحترازية من انتشار و باء كوفيد، بعد توقف طويل أملته الظروف الصحية ببلادنا. حيث سطرت بلسم برنامجها السنوي ، حافلا بمختلف الأنشطة التحسيسية و التوعوية و التكوينية لفائدة الأطفال ذوي التوحد و ذويهم.', 'image_info' => '1617832969.png'],
            ['id' => 17, 'created_at' => '2021-04-07 21:08:05', 'updated_at' => '2021-04-09 20:44:42', 'titre' => 'انطلاق ورشات "التغذية و التوحد"', 'description' => 'تطرح تغذية الطفل التوحدي مشاكل عدة في نوعية محتويات الوجبات، إلى مشكل ميل أطفال التوحد لنمطية متكررة لنفس الوجبة! ... إلى التأثيرات التي تسببها بعض الأغذية على السلوك و الحركة ... من هنا يأتي ضرور تكوين متخصص في تغذية ذوي التوحد، حيث برمجت جمعية بلسم ورشات في موضوع "التغذية و التوحد" من تأطير الدكتورة و الاخصائية في تغذية ذوي التوحد عفاف حفيظ، ستنطلق يوم 25 مارس 2021 لتستمر في تقديم الورشات الجمعة الأخير من كل شهر على الساعة الرابعة مساء.', 'image_info' => '1617833484.jpg'],
            ['id' => 18, 'created_at' => '2021-04-07 21:13:29', 'updated_at' => '2021-04-09 20:43:59', 'titre' => 'انطلاق حصص تقويم النطق', 'description' => 'مشاكل اللغة و التواصل و النطق و مخارج الحروف ... مشاكل شائعة لدى أطفال التوحد، و تقويم النطق من أساسيات التدخل في خطة العلاج، حيث برمجت جمعية بلسم حصص تقويم النطق من تأطير الاخصائية مريم المجدوب، ستنطلق يوم الأربعاء 10مارس 2021 على أن تستمر كل أسبوع ،يوم الأربعاء انطلاق من الساعة الثانية و النصف بعد الزوال.', 'image_info' => '1617833609.jpg'],
            ['id' => 19, 'created_at' => '2021-04-27 22:23:44', 'updated_at' => '2021-04-28 00:47:54', 'titre' => 'تخليد اليوم العالمي لإذكاء الوعي بالتوحد', 'description' => 'في إطار إحتفال العالم باليوم العالمي لإذكاء الوعي بالتوحد لهذه السنة 2021 === --- ، تحت شعار "تعزيز الحق في الاستقلالية والعيش المستقل" من خلال تمتيع الأشخاص ذوي التوحد بالحق في الشغل والتربية والتعليم على قدم المساواة مع الآخرين. ---
خلدت "بلسم" هذا الحدث الدولي و الوطني ذو الجانب التوعوي التحسيسي، من خلال المشاركة في تقليد تنظمه كل دول العالم و تنخرط فيه العديد من المؤسسات الحكومية و غير الحكومية، و ذلك بإضاءة أبرز معالم المدينة باللون الأزرق. حيث تمت إضاءة واجهة مقر بلدية القنيطرة باللون الأزرق طيلة يوم الجمعة، الثاني من أبريل 2021.', 'image_info' => '1619562224.jpg'],
            ['id' => 22, 'created_at' => '2021-07-20 18:55:18', 'updated_at' => '2021-07-20 18:55:18', 'titre' => 'تهنئة عيد الأضحى 2021', 'description' => 'عيد مبارك سعيد', 'image_info' => '1626810918.jpg'],
            ['id' => 23, 'created_at' => '2021-09-12 17:18:02', 'updated_at' => '2021-09-12 18:28:28', 'titre' => 'انطلاق أنشطة جمعية بلسم للموسم الجديد 2021-2022', 'description' => 'تستأنف جمعية بلسم لذوي التوحد يوم الخميس 16 شتنبر 2021 أنشطتها في مقرها بدار الصحة بأولاد اوجيه، فيلا 58، قرب مدرسة "اولاد اوجيه 3"، في احترام تام للشروط الصحية الاحترازية من انتشار وباء كوفيد، بعد توقف خلال شهر غشت. 
حيث تستأنف أنشطتها لفائدة الأطفال ذوي التوحد، بانطلاق حصص الفريق الطبي و الشبه طبي، في متابعته للحالات المسجلة بالجمعية، كل من الأخصائية النفسية، أخصائية تقويم النطق، و أخصائية الحسي حركي، بالإضافة إلى البرنامج السنوي المسطر و الحافل بمختلف الأنشطة التحسيسية و التوعوية و التكوينية لفائدة الأطفال ذوي التوحد و ذويهم.', 'image_info' => '1631470682.jpg'],
            ['id' => 24, 'created_at' => '2021-09-19 14:44:32', 'updated_at' => '2021-09-19 20:59:31', 'titre' => 'بلسم تعقد لقاء تواصلي مع الآباء و الأخصائيين', 'description' => 'في إطار افتتاح الموسم الجديد 2021/2022، لجمعية بلسم لذوي التوحد بالقنيطرة، انعقد على التوالي يومي الخميس و الجمعة 16، 17 شتنبر 2020، لقاءا تواصليا مع آباء و أولياء أطفال التوحد من جهة، و بالفريق الطبي المكون من الأخصائية النفسية، و أخصائية تقويم النطق و أخصائية الحسي الحركي من جهة ثانية، للأطفال المستفيدين بجمعية بلسم.
حيث تم تقديم الشروحات اللازمة من طرف الأخصائيات للخطة العلاجية التي ستنطلق من الأسبوع المقبل، و كذا تقريب سبل المواكبة الخاصة بكل حالة على حدة.
كما تم تقديم ايضا توضيحات لمجموعة من المفاهيم حول اضطراب التوحد، و التأكيد على أن المقاربة الشمولية هي الكفيلة بتحسين حياة أطفال ذوي التوحد و ذلك بإشراك كل من الأسرة و الفريق التربوي.', 'image_info' => '1632088769.jpg'],
            ['id' => 26, 'created_at' => '2022-03-08 08:51:22', 'updated_at' => '2022-03-13 19:24:45', 'titre' => 'بلسم في نشاط ترفيهي بالمنتزه الغابوي', 'description' => 'تحت شعار" المجتمع المدني في خدمة أطفال التوحد"
نظمت جمعية بلسم لذوي التوحد بتنسيق مع نادي أنير التابع لطلبة المدرسة الوطنية للتجارة والتسيير بالقنيطرة،  صبيحة يوم السبت 5مارس 2022 نشاطا تربويا وترفيهيا لفائدة الاطفال ذوي التوحد وأسرهم..بفضاء المنتزه الغابوي الساكنية..
وقد عاش الاطفال وأسرهم اوقاتا ممتعة، وقد تضمن هذا النشاط بعد وجبة الافطار الجماعي.. عدة فقرات وورشات؛ (ألعاب وتلوين وحركات رياضية وتسالي وأغاني..والتعارف بين الاسر...)
ويدخل هذا النشاط الذي استحسنته أسر الأطفال ضمن التحسيس باضطراب التوحد ودمجهم في المحيط الاجتماعي...', 'image_info' => '1646733082.jpg'],
            ['id' => 28, 'created_at' => null, 'updated_at' => null, 'titre' => 'دورة تكوينية في "منهجية مونيتسوري" لفائدة الأسر و المربين', 'description' => 'في إطار تخليد جمعية بلسم لذوي التوحد بالقنيطرة لليوم العالمي للتوحد، تنظم الجمعية دورة تكوينية في "منهجية مونيتسوري" لفائدة الأسر و المربين، في مستوى الحياة العملية و الحسية ---
من تأطير المدربة : سميرة الرجواني، و ذلك يوما السبت و الأحد 19، 20 مارس 2022', 'image_info' => '1647551763.jpg'],
            ['id' => 29, 'created_at' => null, 'updated_at' => null, 'titre' => 'تدريب في : منهجية مونتسوري', 'description' => 'على مدى يومي السبت و الأحد 19، 20 مارس 2022، استفادت أمهات أطفال ذوي التوحد و مرافقات و مربيات، من دورة تكوينية همت موضوع: ركن الحياة العملية والحسية ل"منهجية مونتيسوري" أطرتها المدربة السيدة سميرة الرجواني، التي تميزت بالمزاوجة بين المعرفة النظرية والممارسة التطبيقية. ---
و يأتي تنظيم هذه الدورة التدريبية من طرف جمعية بلسم لذوي التوحد بالقنيطرة، احتفاء باليوم العالمي للتوحد الذي يصادف 2 ابريل من كل سنة.', 'image_info' => '1647813366.jpg'],
            ['id' => 30, 'created_at' => null, 'updated_at' => null, 'titre' => 'ندوة علمية', 'description' => 'في إطار تخليد جمعية "بلسم لذوي التوحد" لليوم العالمي للتوحد الذي يصادف الثاني من شهر أبريل من كل سنة، تنظم ندوة علمية حول موضوع: "الأسرة و المدرسة و المجتمع المدني و أسئلة الإنصاف و تكافؤ الفرص و التكفل بالأطفال ذوي التوحد"، حسب البرنامج التالي للمداخلات: 
	المداخلة الأولى: "خصوصية التكفل النفسي للأطفال ذوي التوحد" من تأطير الدكتور نبيل شكوح، أستاذ بشعبة علم النفس بجامعة ابن طفيل بالقنيطرة.
	المداخلة الثانية: "مسؤولية الأسرة في الدمج الاجتماعي للأطفال ذوي التوحد" من تاطير الأخصائي محمد ناصري، أخصائي نفسي عصبي بمستشفى الرازي بسلا و باحث في سلك الدكتور.
	المداخلة الثالثة: "دور المجتمع المدني في الترافع عن الأشخاص ذوي اضطراب التوحد" من تأطير السيدة عفاف عفان، رئيسة تحالف الجمعيات العاملة في مجال إعاقة التوحد بالمغرب.
و ذلك بقاعة غرفة التجارة و الصناعة بمدينة القنيطرة، يوم الأربعاء 30 مارس 2022 ابتداء من الساعة الثالثة بعد الزوال.', 'image_info' => '1648416100.jpg'],
            ['id' => 31, 'created_at' => null, 'updated_at' => null, 'titre' => 'مشاركة أطفال "بلسم" في حفل الكرمس', 'description' => 'شارك أطفال جمعية بلسم في "حفل الكرمس" المنظم بالمركز الوطني محمد السادس بسلا، على إثر اختتام أشغال الملتقى الوطني ال 13
و بهذه المناسبة تتوجه جمعية بلسم لذوي التوحد للسيد هشام عثماني رئيس القطب التربوي الإجتماعي بالمركز بجزيل الشكر على الدعوة الكريمة و حفاوة الاستقبال و التنظيم المحكم، و إلى كافة مسؤولي و أطر المركز.', 'image_info' => '1648769920.jpg'],
            ['id' => 32, 'created_at' => null, 'updated_at' => null, 'titre' => 'بلسم في ندوة علمية و اسئلة الإنصاف و التكفل باطفال التوحد', 'description' => 'تخليدا لليوم العالمي للتوحد، نظمت جمعية بلسم لذوي التوحد ندوة علمية يوم الأربعاء 30 مارس 2022 في موضوع الأسرة والمدرسة والمجتمع المدني وأسئلة تكافؤ الفرص والانصاف والتكفل بالأطفال ذوي اضطراب التوحد،  
و انقسمت الندوة إلى ثلاث مداخلات أساسية
	المداخلة الأولى: "خصوصية التكفل النفسي للأطفال ذوي التوحد" من تأطير الدكتور نبيل شكوح، أستاذ بشعبة علم النفس بجامعة ابن طفيل بالقنيطرة.
	المداخلة الثانية: "مسؤولية الأسرة في الدمج الاجتماعي للأطفال ذوي التوحد" من تاطير الأخصائي محمد ناصري، أخصائي نفسي عصبي بمستشفى الرازي بسلا و باحث في سلك الدكتور.
	المداخلة الثالثة: "دور المجتمع المدني في الترافع عن الأشخاص ذوي اضطراب التوحد" من تأطير السيدة عفاف عفان، رئيسة تحالف الجمعيات العاملة في مجال إعاقة التوحد بالمغرب.', 'image_info' => '1648770513.jpg'],
            ['id' => 33, 'created_at' => null, 'updated_at' => null, 'titre' => 'بلسم تخلد اليوم العالمي للتوحد 2022', 'description' => 'احتفاء باليوم العالمي للتحسيس باضطراب طيف التوحد، خلدت جمعية بلسم لذوي التوحد بالقنيطرة هذا اليوم، بتنسيق مع إدارة المكتب الوطني للسكك الحديدية، حيث اكتست واجهة محطة القطار بالقنيطرة حلة زرقاء طيلة ليلة يوم الجمعة 08/04/2022. 

هذا وقد حج إلى ساحة محطة القطار  أطفال  وأسر ذوي التوحد إلى جانب بعض الزوار ...  

كما تم توزيع مطويات توعوية تحسيسية  على المسافرين و مرتادي محطة القطار بالقنيطرة، بهدف تسليط الضوء على اضطراب طيف التوحد لاذكاء الوعي لدى أفراد المجتمع بشأن هذا الاضطراب وأسبابه وطرق علاجه وتصحيح المفاهيم الخاطئة والشائعة عنه، وكذا الطرق المثلى للتعامل معه.. كما عرف الحدث تغطية لمجموعة من وسائل الإعلام الوطنية. 

يشار انه تم تخليد هذا الحدث السنة الماضية بالساحة الإدارية لجماعة القنيطرة.', 'image_info' => '1649712104.jpg'],
            ['id' => 34, 'created_at' => null, 'updated_at' => null, 'titre' => 'خرجة التفريغ النفسي للأزواج', 'description' => 'إيمانا منا في جمعية بلسم بالدور المحوري للأسرة كرافعة أساسية في الخطة العلاجية للطفل التوحدي، و ضرورة توفير الاطمئنان النفسي لها، ---و نظرا للضغط الهائل الذي تتعرض له الأسرة بشكل عام و للزوجين بشكل خاص، و إيمانا بدور التربية الإيجابية في تحقيق الاندماج للطفل التوحدي، ---
نظمت جمعية بلسم لذوي التوحد يوم الاحد 26 يونيو 2022، لقاء بنكهة البلسم لإعادة إحياء جميل العشرة الطيبة وصيانة الود والوفاء و المحبة. ---
حيث عرفت الخرجة المقامة على شاطئ مهدية، المؤطرة من طرف الأخصائية النفسية إلهام القرش، مواد و أنشطة ترفيهية مختلفة، ركزت على تقوية مجموعة  من الأهداف : التواصل الفعال بين الأزواج، التفريغ النفسي، الإنصات، بناء الفريق، تقوية الروابط العاطفية بين الزوجين ... ---
و قد عرف النشاط مشاركة مجموعة من الأزواج الذين يتلقى أطفالهم متابعة علاجية داخل جمعية "بلسم".', 'image_info' => '1656528268.jpg'],
            ['id' => 35, 'created_at' => null, 'updated_at' => null, 'titre' => 'خرجة التفريغ النفسي للأزواج', 'description' => 'إيمانا منا في جمعية بلسم بالدور المحوري للأسرة كرافعة أساسية في الخطة العلاجية للطفل التوحدي، و ضرورة توفير الاطمئنان النفسي لها، ---
و نظرا للضغط الهائل الذي تتعرض له الأسرة بشكل عام و للزوجين بشكل خاص، و إيمانا بدور التربية الإيجابية في تحقيق الاندماج للطفل التوحدي، ---
نظمت جمعية بلسم لذوي التوحد يوم الاحد 26 يونيو 2022، لقاء بنكهة البلسم لإعادة إحياء جميل العشرة الطيبة وصيانة الود والوفاء و المحبة. ---
حيث عرفت الخرجة المقامة على شاطئ مهدية، المؤطرة من طرف الأخصائية النفسية إلهام القرش، مواد و أنشطة ترفيهية مختلفة، ركزت على تقوية مجموعة  من الأهداف : التواصل الفعال بين الأزواج، التفريغ النفسي، الإنصات، بناء الفريق، تقوية الروابط العاطفية بين الزوجين ... ---
و قد عرف النشاط مشاركة مجموعة من الأزواج الذين يتلقى أطفالهم المواكبة و المتابعة و التأهيل داخل جمعية "بلسم".', 'image_info' => '1656532127.jpg'],
            ['id' => 36, 'created_at' => null, 'updated_at' => null, 'titre' => 'احتفال بلسم بنجاح كاتبها العام', 'description' => 'احتفت أسرة جمعية بلسم لذوي التوحد بنجاح كاتبها العام الأستاذ عبد القادر الفريحي، بمناسبة نيله شهادة الإجازة في علم الاجتماع في موضوع: "تقييم المدرسين لتجربة أقسام الدمج الخاصة بتدريس الأطفال ذوي اضطراب التوحد" ---
حيث نظم حفل رمزي على شرف هذا التتويج العلمي، تكريسا للروح الأخوية السائدة داخل جمعية بلسم، و ترسيخا لرهان جمعية بلسم على البحث العلمي كرافعة أساسية لمقاربة موضوع التوحد. ---
و تجدر الإشارة الى أن هذه هي الإجازة الثانية التي يحصل عليها السيد عبد القادر الفريحي بعد 20 سنة من حصوله على الأولى، كما أنه هو أستاذ سابق متقاعد. ---
فهنيئا له و لأسرة جمعية بلسم بهذا التتويج العلمي.', 'image_info' => '1657316396.jpg'],
            ['id' => 37, 'created_at' => '2022-07-11 13:56:13', 'updated_at' => '2022-07-11 13:56:13', 'titre' => 'تهنئة عيد الأضحى 2022', 'description' => 'عيد مبارك سعيد', 'image_info' => '1657551367.jpg'],
            ['id' => 38, 'created_at' => null, 'updated_at' => null, 'titre' => 'بلسم في نشاط ترفيهي', 'description' => 'نظمت جمعية بلسم لذوي التوحد بالقنيطرة بشراكة مع نادي ROTARACT ENCG KENITRA نشاطا ترفيهيا فنيا لفائدة أطفال الجمعية صبيحة يوم الأحد 20 نونبر 2022 بفضاء الجمعية، بمناسبة ذكرى المسيرة الخضراء وعيد الاستقلال.---
حيث افتتح النشاط بترديد النشيد الوطني، تلته كلمة للسيد رئيس الجمعية و كلمة عن نادي .ROTARACT  ---
هذا و اشتمل النشاط على فقرات متنوعة ضمت: ورشة للرسم، ورشة للتلوين والصباغة، ورشة رسم حيوانات على الوجه، فقرة البهلوان والأنشطة الحركية الراقصة، ألعاب ... و تخللت هذه الفقرات استراحة شاي استمتع بها الأطفال المشاركون و أسرهم.', 'image_info' => '1669153584.jpg'],
            ['id' => 39, 'created_at' => '2023-02-06 17:15:43', 'updated_at' => '2023-02-06 17:15:43', 'titre' => 'بلسم تعقد اللقاء التواصلي مع الأسر', 'description' => 'نظمت جمعية بلسم لذوي التوحد بالقنيطرة، صبيحة يوم السبت 04 فبراير 2023، لقاءا تواصليا مع أسر الأطفال ذوي التوحد المستفيدين بجمعية بلسم، أطرته الأخصائية النفسية إكرام الخيصي. 

حيث تم تقديم الشروحات اللازمة من طرف الأخصائية للخطة التربوية الفردية المسطرة لأبنائهم، و كذا تقريب سبل المواكبة الخاصة بكل حالة على حدة. 

كما تم تقديم ايضا توضيحات لمجموعة من المفاهيم حول اضطراب طيف التوحد، و التأكيد على أن المقاربة الشمولية هي الكفيلة بتحسين حياة أطفال ذوي التوحد و ذلك بإشراك كل من الأسرة و الفريق التربوي و الفريق الشبه طبي.

اللقاء التواصلي التحسيسي كان مناسبة أيضا بسط فيها رئيس جمعية بلسم بشكل مجمل أهم الأهداف التي وضعتها الجمعية لهذا الموسم و كذا المشاريع المقبلة التي تستهدف تحسين حياة ذوي التوحد.', 'image_info' => '1675707339.jpg'],
            ['id' => 40, 'created_at' => null, 'updated_at' => null, 'titre' => 'بلسم تخلد اليوم العالمي للتوحد 2023', 'description' => 'بمناسبة اليوم العالمي لاذكاء الوعي بالتوحد الذي صادف يوم الأحد 02 أبريل 2023 من هذه السنة، نظمت جمعية بلسم لذوي التوحد، بشراكة مع  أونورا  التابع ل ENCG القنيطرة، نشاطا ترفيهيا لأطفال "بلسم" مع حفل إفطار، بفضاء تقوية قدرات النساء باولاد اوجيه. ---

حيث عرفت هذه المناسبة إقبالا من طرف جل المشاركين، الذين انخرطو في ورشات 
الرسم، التلوين، الاوريكامي، البازل .. كما عرف الحفل تنشيطا موسيقيا من طرف بهلوان، بالإضافة إلى ألعاب الحركة و القفز  "طرومبولين". ---

هذا و قد ختم النشاط بحفل إفطار على شرف المشاركين في جو أسري بهيج، شاركت فيه الأسر، تخللته كلمات للمنظمين و لبعض المشاركات', 'image_info' => '1681062837.jpg'],
        ]);
    }
}
