<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ProjetsSeeder extends Seeder
{
    public function run(): void
    {
        DB::table('projets')->insert([
            ['id' => 1, 'created_at' => '2021-04-25 14:19:25', 'updated_at' => '2021-04-26 21:50:45', 'titre' => 'مركز متخصص', 'description' => null, 'structured_description' => '{"sections": [{"id": "paragraph_6a4112fd6cafb5.24243899", "type": "paragraph", "content": "---          ==  إنشاء مركز متخصص : ---\\r\\n\\r\\nإنشاء مركز متخصص، شامل لكل احتياجات ذوي التوحد من التشخيص إلى تحديد خطة العلاج إلى الإدماج التام."}]}', 'projet_image' => '1619360365.png', 'status' => 1],
            ['id' => 2, 'created_at' => '2021-04-25 18:53:14', 'updated_at' => '2021-04-27 00:02:22', 'titre' => 'مشاريع بلسم', 'description' => null, 'structured_description' => '{"sections": [{"id": "paragraph_6a4112fd6e79e9.87847050", "type": "paragraph", "content": "---  محاور اشتغال بلسم : == ---\\r\\nبلسم لذوي التوحد جمعية تعمل في مجال التوحد و تشتغل أساسا على أربعة محاور : ---\\r\\nالمحور الأول: === ---\\r\\n التحسيس بقضية التوحد داخل المجتمع المغربي و إذكاء الوعي بها، ---\\r\\nالمحour الثاني: === --- تكوين الأسر من آباء وأمهات وإخوة و كذا مرافقيهم في مجال التوحد، و مواكبتهم وتمكينهم من أساليب التنشئة الميسرة للاندماج في المجتمع، ---\\r\\nالمحور الثالث: === --- المرافعة حول ملف التوحد، بالنهوض و حماية حقوقهم وفقا للمعايير الدولية لحقوق الإنسان كما هي منصوص عليها في الاتفاقيات الدولية التي صادق عليها المغرب ولاسيما الاتفاقية الدولية لحقوق الأشخاص ذوي الإعاقة وفي إطار احترام مقتضيات الدستور، ---\\r\\nالمحور الرابع: === --- إنشاء مركز متخصص، شامل لكل احتياجات ذوي التوحد من التشخيص إلى تحديد خطة العلاج إلى الإدماج التام..\\r\\nهذا وتعمل بلسم على تحقيق هذه الأهداف بتعاون و شراكة مع كل الجهات التي أخدت على عاتقها حمل مشعل قضية التوحد."}]}', 'projet_image' => '1619376794.jpg', 'status' => -1],
            ['id' => 3, 'created_at' => '2021-04-26 23:27:14', 'updated_at' => '2021-04-26 23:27:14', 'titre' => 'التكوين', 'description' => null, 'structured_description' => '{"sections": [{"id": "paragraph_6a4112fd6fa213.78997658", "type": "paragraph", "content": "تكوين الأسر من آباء وأمهات وإخوة و كذا مرافقيهم في مجال التوحد، و مواكبتهم وتمكينهم من أساليب التنشئة الميسرة للاندماج في المجتمع،"}]}', 'projet_image' => '1619479634.jpg', 'status' => 1],
            ['id' => 4, 'created_at' => '2021-04-26 23:29:54', 'updated_at' => '2021-04-26 23:29:54', 'titre' => 'المرافعة', 'description' => null, 'structured_description' => '{"sections": [{"id": "paragraph_6a4112fd709b68.62526726", "type": "paragraph", "content": "المرافعة حول ملف التوحد، بالنهوض و حماية حقوقهم وفقا للمعايير الدولية لحقوق الإنسان كما هي منصوص عليها في الاتفاقيات الدولية التي صادق عليها المغرب ولاسيما الاتفاقية الدولية لحقوق الأشخاص ذوي الإعاقة وفي إطار احترام مقتضيات الدستور"}]}', 'projet_image' => '1619479794.jpg', 'status' => 1],
            ['id' => 5, 'created_at' => '2021-04-26 23:38:03', 'updated_at' => '2021-04-26 23:38:03', 'titre' => 'التحسيس', 'description' => null, 'structured_description' => '{"sections": [{"id": "paragraph_6a4112fd71b5d6.12112162", "type": "paragraph", "content": "التحسيس بقضية التوحد داخل المجتمع المغربي و إذكاء الوعي بها"}]}', 'projet_image' => '1619480283.jpg', 'status' => 1],
        ]);
    }
}
